_org/2016-08-20-Update_Emacs_Config.org
#+STARTUP: indent
#+STARTUP: showall
#+PROPERTY: header-args :results silent
#+BEGIN_HTML
---
layout: post
title: Literal Programming for Emacs Configure
---
#+END_HTML

#+TITLE:   Literal Programming for Emacs Configure
#+author:  Jianming Qu

Ever since I used Emacs, I was using the config template from my friend [[http://blog.oyanglul.us][Ouyang Jichao]] without truely understand everything. That why I started to reconfig all the settings. Now I have a quite different configuration file, and I am happy to share it to the public.

* High level solution
- Dependency and package management
  - 使用 Cask & Pallet 管理 Emacs 的依赖. (Pallet 用来自动同步在 Emacs 中安装的依赖到 Cask 文件中)
  - 描述文件: [[https://github.com/SanCoder-Q/.emacs.d/blob/master/Cask][Cask]]

- Bootstrap
  - 步骤:
    1. [[cask-loading][通过初始化 Cask 加载依赖]]
    2. [[org-config-loading][初始化 org-mode, 利用 org-babel 将本文中的配置导出为 config.el 文件并 evaluate.]]
  - 描述文件: [[https://github.com/SanCoder-Q/.emacs.d/blob/master/init.el][init.el]]


* General configuration
- Initialization
  + Cask loading <<cask-loading>>
#+BEGIN_SRC emacs-lisp :tangle no :eval never
  (require 'cask "/usr/local/Cellar/cask/0.7.2_1/cask.el")
  (cask-initialize)
  (require 'pallet)
  (pallet-mode t)
#+END_SRC

  + Org config loading <<org-config-loading>>
#+BEGIN_SRC emacs-lisp :tangle no :eval never
  (require 'org)
  (setq org-confirm-babel-evaluate nil)
  (org-babel-load-file "~/.emacs.d/config.org")
#+END_SRC

- 开启 Emacs server 模式
#+BEGIN_SRC emacs-lisp
  (server-start)
#+END_SRC

- 编辑设置
#+BEGIN_SRC emacs-lisp
  (global-superword-mode 1) ;; 将 camel case 和以 `-` 连接的字符看作一个 word
  (delete-selection-mode 1) ;; 粘贴后取消选择
  (global-auto-revert-mode 1) ;; 当外部变更文档后自动更新当前文档
  (electric-indent-mode t) ;; 文档自动缩进
  (global-linum-mode t) ;; 显示行号

  (setq-default auto-save-default nil ;; 关闭 Auto-save
                auto-save-list-file-prefix nil ;; 停止创建 auto-save-list 文件夹
                indent-tabs-mode nil ;; 使用空格代替 tab
                ring-bell-function 'ignore ;; 关闭 alarm bell
                make-backup-files nil) ;; 关闭自动创建备份文件

  (setq kill-buffer-query-functions
        (remq 'process-kill-buffer-query-function
              kill-buffer-query-functions)) ;; 取消关闭文件时的确认

  (require 'pager) ;; 使用 pager.el 代替系统的翻页, 需要在 key map 里替换
#+END_SRC


* Style configuration
#+BEGIN_SRC emacs-lisp
  (load-theme 'sanityinc-tomorrow-blue t) ;; 修改主题
  (set-frame-parameter (selected-frame) 'alpha '(95 . 80)) ;; 设置背景透明, 分别为 Emacs active 和 unactive 时的透明度
  (set-background-color "#000620") ;; 加深背景颜色 (为了使背景颜色应用到所有 mode 需要修改theme文件中的背景颜色)

  (set-default-font "Envy Code R") ;; 修改默认字体
  (set-face-attribute 'default nil :height 200) ;; 修改默认字体缩放大小
  (tool-bar-mode -1) ;; 关闭上方的工具栏
  (scroll-bar-mode -1) ;; 关闭右侧的滚动条
  (show-paren-mode t) ;; 高亮显示 pair 的括号

  (setq split-width-threshold 1
        split-height-threshold nil) ;; 设置默认分屏为垂直分屏

  (ocodo-svg-modelines-init) ;; 渲染 mode-line
  (smt/set-theme 'ocodo-mesh-aqua-smt) ;; 设置 mode-line 主题

  (on-screen-global-mode 1) ;; 翻页的事后加一条小黑线
  (setq on-screen-highlight-method 'narrow-line)

#+END_SRC


