_posts/2016-08-20-Update_Emacs_Config.org.html
---
layout: post
title: Literal Programming for Emacs Configure
---

<p>
Ever since I used Emacs, I was using the config template from my friend <a href="http://blog.oyanglul.us">Ouyang Jichao</a> without truely understand everything. That why I started to reconfig all the settings. Now I have a quite different configuration file, and I am happy to share it to the public.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> High level solution</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Dependency and package management
<ul class="org-ul">
<li>使用 Cask &amp; Pallet 管理 Emacs 的依赖. (Pallet 用来自动同步在 Emacs 中安装的依赖到 Cask 文件中)</li>
<li>描述文件: <a href="https://github.com/SanCoder-Q/.emacs.d/blob/master/Cask">Cask</a></li>
</ul></li>

<li>Bootstrap
<ul class="org-ul">
<li>步骤:
<ol class="org-ol">
<li><a href="#orgtarget1">通过初始化 Cask 加载依赖</a></li>
<li><a href="#orgtarget2">初始化 org-mode, 利用 org-babel 将本文中的配置导出为 config.el 文件并 evaluate.</a></li>
</ol></li>
<li>描述文件: <a href="https://github.com/SanCoder-Q/.emacs.d/blob/master/init.el">init.el</a></li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> General configuration</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Initialization
<ul class="org-ul">
<li>Cask loading <a id="orgtarget1"></a></li>
</ul></li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">require</span> '<span style="color: #bbdaff;">cask</span> <span style="color: #99ffff;">"/usr/local/Cellar/cask/0.7.2_1/cask.el"</span>)
(cask-initialize)
(<span style="color: #d1f1a9;">require</span> '<span style="color: #bbdaff;">pallet</span>)
(pallet-mode t)
</pre>
</div>

<ul class="org-ul">
<li>Org config loading <a id="orgtarget2"></a></li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">require</span> '<span style="color: #bbdaff;">org</span>)
(<span style="color: #d1f1a9;">setq</span> org-confirm-babel-evaluate nil)
(org-babel-load-file <span style="color: #99ffff;">"~/.emacs.d/config.org"</span>)
</pre>
</div>

<ul class="org-ul">
<li>开启 Emacs server 模式</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(server-start)
</pre>
</div>

<ul class="org-ul">
<li>编辑设置</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-superword-mode 1) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#23558; camel case &#21644;&#20197; `-` &#36830;&#25509;&#30340;&#23383;&#31526;&#30475;&#20316;&#19968;&#20010; word</span>
(delete-selection-mode 1) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#31896;&#36148;&#21518;&#21462;&#28040;&#36873;&#25321;</span>
(global-auto-revert-mode 1) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#24403;&#22806;&#37096;&#21464;&#26356;&#25991;&#26723;&#21518;&#33258;&#21160;&#26356;&#26032;&#24403;&#21069;&#25991;&#26723;</span>
(electric-indent-mode t) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#25991;&#26723;&#33258;&#21160;&#32553;&#36827;</span>
(global-linum-mode t) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#26174;&#31034;&#34892;&#21495;</span>

(<span style="color: #d1f1a9;">setq-default</span> auto-save-default nil <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#20851;&#38381; Auto-save</span>
              auto-save-list-file-prefix nil <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#20572;&#27490;&#21019;&#24314; auto-save-list &#25991;&#20214;&#22841;</span>
              indent-tabs-mode nil <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#20351;&#29992;&#31354;&#26684;&#20195;&#26367; tab</span>
              ring-bell-function 'ignore <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#20851;&#38381; alarm bell</span>
              make-backup-files nil) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#20851;&#38381;&#33258;&#21160;&#21019;&#24314;&#22791;&#20221;&#25991;&#20214;</span>

(<span style="color: #d1f1a9;">setq</span> kill-buffer-query-functions
      (remq 'process-kill-buffer-query-function
            kill-buffer-query-functions)) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#21462;&#28040;&#20851;&#38381;&#25991;&#20214;&#26102;&#30340;&#30830;&#35748;</span>

(<span style="color: #d1f1a9;">require</span> '<span style="color: #bbdaff;">pager</span>) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#20351;&#29992; pager.el &#20195;&#26367;&#31995;&#32479;&#30340;&#32763;&#39029;, &#38656;&#35201;&#22312; key map &#37324;&#26367;&#25442;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Style configuration</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(load-theme 'sanityinc-tomorrow-blue t) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#20462;&#25913;&#20027;&#39064;</span>
(set-frame-parameter (selected-frame) 'alpha '(95 . 80)) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#35774;&#32622;&#32972;&#26223;&#36879;&#26126;, &#20998;&#21035;&#20026; Emacs active &#21644; unactive &#26102;&#30340;&#36879;&#26126;&#24230;</span>
(set-background-color <span style="color: #99ffff;">"#000620"</span>) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#21152;&#28145;&#32972;&#26223;&#39068;&#33394; (&#20026;&#20102;&#20351;&#32972;&#26223;&#39068;&#33394;&#24212;&#29992;&#21040;&#25152;&#26377; mode &#38656;&#35201;&#20462;&#25913;theme&#25991;&#20214;&#20013;&#30340;&#32972;&#26223;&#39068;&#33394;)</span>

(set-default-font <span style="color: #99ffff;">"Envy Code R"</span>) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#20462;&#25913;&#40664;&#35748;&#23383;&#20307;</span>
(set-face-attribute 'default nil <span style="color: #ebbbff;">:height</span> 200) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#20462;&#25913;&#40664;&#35748;&#23383;&#20307;&#32553;&#25918;&#22823;&#23567;</span>
(tool-bar-mode -1) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#20851;&#38381;&#19978;&#26041;&#30340;&#24037;&#20855;&#26639;</span>
(scroll-bar-mode -1) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#20851;&#38381;&#21491;&#20391;&#30340;&#28378;&#21160;&#26465;</span>
(show-paren-mode t) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#39640;&#20142;&#26174;&#31034; pair &#30340;&#25324;&#21495;</span>

(<span style="color: #d1f1a9;">setq</span> split-width-threshold 1
      split-height-threshold nil) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#35774;&#32622;&#40664;&#35748;&#20998;&#23631;&#20026;&#22402;&#30452;&#20998;&#23631;</span>

(ocodo-svg-modelines-init) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#28210;&#26579; mode-line</span>
(smt/set-theme 'ocodo-mesh-aqua-smt) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#35774;&#32622; mode-line &#20027;&#39064;</span>

(on-screen-global-mode 1) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#32763;&#39029;&#30340;&#20107;&#21518;&#21152;&#19968;&#26465;&#23567;&#40657;&#32447;</span>
(<span style="color: #d1f1a9;">setq</span> on-screen-highlight-method 'narrow-line)
</pre>
</div>
</div>
</div>
