_org/2016-08-20-Update_Emacs_Config.org
* Key modification
- Meta key 设为 =Command=
#+BEGIN_SRC emacs-lisp
  (when (eq system-type 'darwin)
    (setq mac-option-modifier 'super)
    (setq mac-command-modifier 'meta))
#+END_SRC

- Keymap
#+NAME: gen-keys
#+BEGIN_SRC emacs-lisp :var keys=mkeys :results output :tangle no :exports none :colnames nil
  (mapcar (lambda (l)
            (let* ((key (car l))
                   (command (car (cdr l)))
                   (def (format "global-set-key (kbd \"%s\")" key)))
              (princ (format "(%s %s)\n" def command))))
          keys)
#+END_SRC

#+TBLNAME: mkeys
| Keys          | Command                     | Category  | Description                                                |
|---------------+-----------------------------+-----------+------------------------------------------------------------|
| M-q           | 'save-buffers-kill-terminal | General   | Kill emacs                                                 |
| M-z           | 'undo                       | General   | Undo                                                       |
| M-S-z         | 'redo                       | General   | Redo                                                       |
| C-M-<return>  | 'set-mark-command           | General   | Set mark                                                   |
| C-x <return>  | 'pop-to-mark-command        | General   | Jump back                                                  |
| M-<backspace> | 'kill-whole-line            | General   | Kill whole line                                            |
| M-k           | 'delete-other-windows       | General   | Only keep the current window                               |
| M-c           | 'kill-ring-save             | General   | Copy region or current line                                |
| C-7           | 'er/contract-region         | General   | Shrink select                                              |
| C-8           | 'er/expand-region           | General   | Expand select                                              |
| C-x b         | 'helm-for-files             | Helm      | Using helm buffer                                          |
| M-x           | 'helm-M-x                   | Helm      | Using helm command buffer instead of native command buffer |
| C-c h m       | 'helm-imenu                 | Helm      | Show the document menu in mini buffer                      |
| M-s           | 'helm-occur                 | Helm      | Search the text in current doc by giving in mini buffer    |
| C-x C-f       | 'helm-find-files            | Helm      | Find file by showing the candidates in mini buffer         |
| M-y           | 'helm-show-kill-ring        | Helm      | Yank by showing the clipboard in mini buffer               |
| <f7>          | 'toggle-window-split        | Customize | Toggle the split window between vertical and horizontal    |
| C-v           | 'pager-page-down            | Pager     | Using pager.el instead of native page scroll               |
| M-v           | 'pager-page-up              | Pager     | Using pager.el instead of native page scroll               |
| C-<           | 'mc/mark-previous-like-this | M-Cursor  | Multiple select above                                      |
| C->           | 'mc/mark-next-like-this     | M-Cursor  | Multiple select below                                      |
| C-*           | 'mc/mark-all-like-this      | M-Cursor  | Multiple select all                                        |

- Key translation
#+NAME: trans-keys
#+BEGIN_SRC emacs-lisp :var keys=tkeys :results output :tangle no :exports none :colnames nil
  (mapcar (lambda (l)
            (let* ((srckey (car l))
                   (deskey (car (cdr l))))
              (princ (format "(keyboard-translate %s %s)\n" srckey deskey))))
          keys)
#+END_SRC

使用 Emacs [[http://ergoemacs.org/emacs_manual/elisp/Ctl_002dChar-Syntax.html][控制符号]] 描述
#+TBLNAME: tkeys
| From  | To    | Description    |
|-------+-------+----------------|
| ?\C-h | ?\C-? | C-h for delete |

#+BEGIN_SRC emacs-lisp :noweb yes :exports none
  <<gen-keys()>>
  <<trans-keys()>>
#+END_SRC


* User Settings
用户设置, 放一些不想密码或敏感内容
#+BEGIN_SRC emacs-lisp
 (when (file-readable-p ".user.el") (load ".user.el"))
#+END_SRC


* Modes
** General
*** Helm
#+BEGIN_SRC emacs-lisp
  (require 'helm-config)
  (helm-mode 1)
  (helm-autoresize-mode t)
#+END_SRC

*** Projectile
#+BEGIN_SRC emacs-lisp
  (projectile-global-mode)
  (helm-projectile-on)
#+END_SRC

*** Company
Complete anything. Emacs 自动补全插件.
#+BEGIN_SRC emacs-lisp
  (add-hook 'after-init-hook 'global-company-mode)
  (with-eval-after-load 'company
    (add-to-list 'company-backends 'company-files t))
#+END_SRC

*** Ispell & Flyspell
#+BEGIN_SRC emacs-lisp
  (with-eval-after-load 'company
    (add-to-list 'company-backends 'company-ispell t))
  (add-hook 'org-mode-hook 'flyspell-mode)
#+END_SRC

*** Editorconfig
#+BEGIN_SRC emacs-lisp
  (require 'editorconfig)
  (editorconfig-mode 1)
#+END_SRC

*** Indent Setting
#+BEGIN_SRC emacs-lisp
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-code-indent-offset 2)
  (setq js2-basic-offset 2)
#+END_SRC


** Language aspect
