_posts/2016-08-20-Update_Emacs_Config.org.html


<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Key modification</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Meta key 设为 <code>Command</code></li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">when</span> (eq system-type 'darwin)
  (<span style="color: #d1f1a9;">setq</span> mac-option-modifier 'super)
  (<span style="color: #d1f1a9;">setq</span> mac-command-modifier 'meta))
</pre>
</div>

<ul class="org-ul">
<li>Keymap</li>
</ul>
<table id="orgtable1" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keys</th>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Category</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-q</td>
<td class="org-left">'save-buffers-kill-terminal</td>
<td class="org-left">General</td>
<td class="org-left">Kill emacs</td>
</tr>

<tr>
<td class="org-left">M-z</td>
<td class="org-left">'undo</td>
<td class="org-left">General</td>
<td class="org-left">Undo</td>
</tr>

<tr>
<td class="org-left">M-S-z</td>
<td class="org-left">'redo</td>
<td class="org-left">General</td>
<td class="org-left">Redo</td>
</tr>

<tr>
<td class="org-left">C-M-&lt;return&gt;</td>
<td class="org-left">'set-mark-command</td>
<td class="org-left">General</td>
<td class="org-left">Set mark</td>
</tr>

<tr>
<td class="org-left">C-x &lt;return&gt;</td>
<td class="org-left">'pop-to-mark-command</td>
<td class="org-left">General</td>
<td class="org-left">Jump back</td>
</tr>

<tr>
<td class="org-left">M-&lt;backspace&gt;</td>
<td class="org-left">'kill-whole-line</td>
<td class="org-left">General</td>
<td class="org-left">Kill whole line</td>
</tr>

<tr>
<td class="org-left">M-k</td>
<td class="org-left">'delete-other-windows</td>
<td class="org-left">General</td>
<td class="org-left">Only keep the current window</td>
</tr>

<tr>
<td class="org-left">M-c</td>
<td class="org-left">'kill-ring-save</td>
<td class="org-left">General</td>
<td class="org-left">Copy region or current line</td>
</tr>

<tr>
<td class="org-left">C-7</td>
<td class="org-left">'er/contract-region</td>
<td class="org-left">General</td>
<td class="org-left">Shrink select</td>
</tr>

<tr>
<td class="org-left">C-8</td>
<td class="org-left">'er/expand-region</td>
<td class="org-left">General</td>
<td class="org-left">Expand select</td>
</tr>

<tr>
<td class="org-left">C-x b</td>
<td class="org-left">'helm-for-files</td>
<td class="org-left">Helm</td>
<td class="org-left">Using helm buffer</td>
</tr>

<tr>
<td class="org-left">M-x</td>
<td class="org-left">'helm-M-x</td>
<td class="org-left">Helm</td>
<td class="org-left">Using helm command buffer instead of native command buffer</td>
</tr>

<tr>
<td class="org-left">C-c h m</td>
<td class="org-left">'helm-imenu</td>
<td class="org-left">Helm</td>
<td class="org-left">Show the document menu in mini buffer</td>
</tr>

<tr>
<td class="org-left">M-s</td>
<td class="org-left">'helm-occur</td>
<td class="org-left">Helm</td>
<td class="org-left">Search the text in current doc by giving in mini buffer</td>
</tr>

<tr>
<td class="org-left">C-x C-f</td>
<td class="org-left">'helm-find-files</td>
<td class="org-left">Helm</td>
<td class="org-left">Find file by showing the candidates in mini buffer</td>
</tr>

<tr>
<td class="org-left">M-y</td>
<td class="org-left">'helm-show-kill-ring</td>
<td class="org-left">Helm</td>
<td class="org-left">Yank by showing the clipboard in mini buffer</td>
</tr>

<tr>
<td class="org-left">&lt;f7&gt;</td>
<td class="org-left">'toggle-window-split</td>
<td class="org-left">Customize</td>
<td class="org-left">Toggle the split window between vertical and horizontal</td>
</tr>

<tr>
<td class="org-left">C-v</td>
<td class="org-left">'pager-page-down</td>
<td class="org-left">Pager</td>
<td class="org-left">Using pager.el instead of native page scroll</td>
</tr>

<tr>
<td class="org-left">M-v</td>
<td class="org-left">'pager-page-up</td>
<td class="org-left">Pager</td>
<td class="org-left">Using pager.el instead of native page scroll</td>
</tr>

<tr>
<td class="org-left">C-&lt;</td>
<td class="org-left">'mc/mark-previous-like-this</td>
<td class="org-left">M-Cursor</td>
<td class="org-left">Multiple select above</td>
</tr>

<tr>
<td class="org-left">C-&gt;</td>
<td class="org-left">'mc/mark-next-like-this</td>
<td class="org-left">M-Cursor</td>
<td class="org-left">Multiple select below</td>
</tr>

<tr>
<td class="org-left">C-*</td>
<td class="org-left">'mc/mark-all-like-this</td>
<td class="org-left">M-Cursor</td>
<td class="org-left">Multiple select all</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Key translation</li>
</ul>
<p>
使用 Emacs <a href="http://ergoemacs.org/emacs_manual/elisp/Ctl_002dChar-Syntax.html">控制符号</a> 描述
</p>
<table id="orgtable2" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">From</th>
<th scope="col" class="org-left">To</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">?\C-h</td>
<td class="org-left">?\C-?</td>
<td class="org-left">C-h for delete</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> User Settings</h2>
<div class="outline-text-2" id="text-5">
<p>
用户设置, 放一些不想密码或敏感内容
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">when</span> (file-readable-p <span style="color: #99ffff;">".user.el"</span>) (load <span style="color: #99ffff;">".user.el"</span>))
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline26" class="outline-2">
<h2 id="orgheadline26"><span class="section-number-2">6</span> Modes</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">6.1</span> General</h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">6.1.1</span> Helm</h4>
<div class="outline-text-4" id="text-6-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">require</span> '<span style="color: #bbdaff;">helm-config</span>)
(helm-mode 1)
(helm-autoresize-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">6.1.2</span> Projectile</h4>
<div class="outline-text-4" id="text-6-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(projectile-global-mode)
(helm-projectile-on)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">6.1.3</span> Company</h4>
<div class="outline-text-4" id="text-6-1-3">
<p>
Complete anything. Emacs 自动补全插件.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'global-company-mode)
(<span style="color: #d1f1a9;">with-eval-after-load</span> 'company
  (add-to-list 'company-backends 'company-files t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">6.1.4</span> Ispell &amp; Flyspell</h4>
<div class="outline-text-4" id="text-6-1-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">with-eval-after-load</span> 'company
  (add-to-list 'company-backends 'company-ispell t))
(add-hook 'org-mode-hook 'flyspell-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">6.1.5</span> Editorconfig</h4>
<div class="outline-text-4" id="text-6-1-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">require</span> '<span style="color: #bbdaff;">editorconfig</span>)
(editorconfig-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">6.1.6</span> Indent Setting</h4>
<div class="outline-text-4" id="text-6-1-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">setq</span> web-mode-markup-indent-offset 2)
(<span style="color: #d1f1a9;">setq</span> web-mode-code-indent-offset 2)
(<span style="color: #d1f1a9;">setq</span> js2-basic-offset 2)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">6.2</span> Language aspect</h3>
