_org/2016-08-20-Update_Emacs_Config.org
*** Org
#+BEGIN_SRC emacs-lisp
  (org-indent-mode t)
  (setq org-use-sub-superscripts '{}) ;; 显式的使用A_{B}来表示B是A的角标
  (setq org-export-with-sub-superscripts '{}) ;; 显式的使用A_{B}来表示B是A的角标
  (setq-default org-cycle-emulate-tab 'white) ;; Tab 键仅在空白行中为输入 tab, 其他情况均为展开或关闭 section
  (add-hook 'org-mode-hook 'visual-line-mode) ;; 回行
  (set-face-attribute 'org-level-1 nil :height 1.6 :bold t)
  (set-face-attribute 'org-level-2 nil :height 1.4 :bold t)
  (set-face-attribute 'org-level-3 nil :height 1.2 :bold t)
#+END_SRC

**** Source block template
#+NAME: src-tmpl
#+BEGIN_SRC emacs-lisp :var srcmap=src-alias :results output :tangle no :exports none :colnames nil
    (mapcar (lambda (l)
              (let* ((alias (car l))
                     (source (car (cdr l)))
                     (args (car (last l)))
                     (tmpl (format "(\"%s\" \"#+BEGIN_SRC %s %s\\n?\\n#+END_SRC\\n\")" alias source args)))
                (princ (format "(add-to-list 'org-structure-template-alist '%s)\n" tmpl))))
            srcmap)
#+END_SRC

#+TBLNAME: src-alias
| Alias | Actual source | Header arguments |
|-------+---------------+------------------|
| e     | emacs-lisp    |                  |
| j     | js            |                  |
| s     | scala         |                  |
| r     | ruby          |                  |
| h     | haskell       |                  |
| S     | scheme        |                  |
| sh    | shell-script  |                  |

#+BEGIN_SRC emacs-lisp :noweb yes :exports none
  <<src-tmpl()>>
#+END_SRC

**** Publish
Emacs 2.5 需要单独安装 htmlize 来支持代码发布的语法高亮功能!

#+BEGIN_SRC emacs-lisp
  (setq org-html-validation-link nil)
  (setq org-export-html-coding-system 'utf-8-unix)
  (setq org-publish-use-timestamps-flag nil) ;; 每次重新发布html
  (setq org-publish-project-alist
        '(("blog"
           :base-directory "~/Dev/blog/sancoder-q.github.io/_org/"
           :base-extension "org"
           :publishing-directory "~/Dev/blog/sancoder-q.github.io/_posts"
           :html-extension "org.html"
           :sub-superscript "{}"
           :htmlized-source t
           :recursive t
           :publishing-function org-html-publish-to-html
           :section-numbers 4
           :with-toc nil
           :body-only t)))
#+END_SRC


*** Emacs-lisp
#+BEGIN_SRC emacs-lisp
  (define-key emacs-lisp-mode-map (kbd "C-c C-c") 'eval-buffer)
#+END_SRC

*** HTML
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
  (eval-after-load "web-mode"
    '(setq web-mode-enable-auto-expanding t))
#+END_SRC

*** JavaScript
**** Tern
Tern 是一款 Javascript 代码分析工具. Tern-mode 在后台打开 tern server, 通过中间件与 emacs 通信, 实现 JS 代码补全和跳转.
#+BEGIN_SRC emacs-lisp
  (with-eval-after-load 'company
    (add-to-list 'company-backends 'company-tern))
#+END_SRC

**** js2-mode
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
  (add-to-list 'auto-mode-alist '("\\.jsx\\'" . js2-jsx-mode))
#+END_SRC

*** C#
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.cs\\'" . csharp-mode))
#+END_SRC

*** Scala
**** scala-mode
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.sbt\\'" . scala-mode))
  (add-to-list 'auto-mode-alist '("\\.sc\\'" . scala-mode))
  (add-to-list 'auto-mode-alist '("\\.scala\\'" . scala-mode))
#+END_SRC

**** ensime
#+BEGIN_SRC emacs-lisp
  ;; (require 'ensime)
  ;; (add-hook 'scala-mode-hook 'ensime-mode)
#+END_SRC


* Customize
** Toggle window split
#+BEGIN_SRC emacs-lisp
  (defun toggle-window-split ()
    (interactive)
    (if (= (count-windows) 2)
        (let* ((this-win-buffer (window-buffer))
               (next-win-buffer (window-buffer (next-window)))
               (this-win-edges (window-edges (selected-window)))
               (next-win-edges (window-edges (next-window)))
               (this-win-2nd (not (and (<= (car this-win-edges)
                                           (car next-win-edges))
                                       (<= (cadr this-win-edges)
                                           (cadr next-win-edges)))))
               (splitter
                (if (= (car this-win-edges)
                       (car (window-edges (next-window))))
                    'split-window-horizontally
                  'split-window-vertically)))
          (delete-other-windows)
          (let ((first-win (selected-window)))
            (funcall splitter)
            (if this-win-2nd (other-window 1))
            (set-window-buffer (selected-window) this-win-buffer)
            (set-window-buffer (next-window) next-win-buffer)
            (select-window first-win)
            (if this-win-2nd (other-window 1))))))
#+END_SRC

