_posts/2016-08-20-Update_Emacs_Config.org.html
<div class="outline-text-3" id="text-6-2">
</div><div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">6.2.1</span> Org</h4>
<div class="outline-text-4" id="text-6-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-indent-mode t)
(<span style="color: #d1f1a9;">setq</span> org-use-sub-superscripts '{}) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#26174;&#24335;&#30340;&#20351;&#29992;A_{B}&#26469;&#34920;&#31034;B&#26159;A&#30340;&#35282;&#26631;</span>
(<span style="color: #d1f1a9;">setq</span> org-export-with-sub-superscripts '{}) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#26174;&#24335;&#30340;&#20351;&#29992;A_{B}&#26469;&#34920;&#31034;B&#26159;A&#30340;&#35282;&#26631;</span>
(<span style="color: #d1f1a9;">setq-default</span> org-cycle-emulate-tab 'white) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">Tab &#38190;&#20165;&#22312;&#31354;&#30333;&#34892;&#20013;&#20026;&#36755;&#20837; tab, &#20854;&#20182;&#24773;&#20917;&#22343;&#20026;&#23637;&#24320;&#25110;&#20851;&#38381; section</span>
(add-hook 'org-mode-hook 'visual-line-mode) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#22238;&#34892;</span>
(set-face-attribute 'org-level-1 nil <span style="color: #ebbbff;">:height</span> 1.6 <span style="color: #ebbbff;">:bold</span> t)
(set-face-attribute 'org-level-2 nil <span style="color: #ebbbff;">:height</span> 1.4 <span style="color: #ebbbff;">:bold</span> t)
(set-face-attribute 'org-level-3 nil <span style="color: #ebbbff;">:height</span> 1.2 <span style="color: #ebbbff;">:bold</span> t)
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="orgheadline13"></a>Source block template<br  /><div class="outline-text-5" id="text-6-2-1-1">
<table id="orgtable3" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Alias</th>
<th scope="col" class="org-left">Actual source</th>
<th scope="col" class="org-left">Header arguments</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">e</td>
<td class="org-left">emacs-lisp</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">j</td>
<td class="org-left">js</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">scala</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">ruby</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">haskell</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">scheme</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sh</td>
<td class="org-left">shell-script</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div></li>

<li><a id="orgheadline14"></a>Publish<br  /><div class="outline-text-5" id="text-6-2-1-2">
<p>
Emacs 2.5 需要单独安装 htmlize 来支持代码发布的语法高亮功能!
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">setq</span> org-html-validation-link nil)
(<span style="color: #d1f1a9;">setq</span> org-export-html-coding-system 'utf-8-unix)
(<span style="color: #d1f1a9;">setq</span> org-publish-use-timestamps-flag nil) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#27599;&#27425;&#37325;&#26032;&#21457;&#24067;html</span>
(<span style="color: #d1f1a9;">setq</span> org-publish-project-alist
      '((<span style="color: #99ffff;">"blog"</span>
         <span style="color: #ebbbff;">:base-directory</span> <span style="color: #99ffff;">"~/Dev/blog/sancoder-q.github.io/_org/"</span>
         <span style="color: #ebbbff;">:base-extension</span> <span style="color: #99ffff;">"org"</span>
         <span style="color: #ebbbff;">:publishing-directory</span> <span style="color: #99ffff;">"~/Dev/blog/sancoder-q.github.io/_posts"</span>
         <span style="color: #ebbbff;">:html-extension</span> <span style="color: #99ffff;">"org.html"</span>
         <span style="color: #ebbbff;">:sub-superscript</span> <span style="color: #99ffff;">"{}"</span>
         <span style="color: #ebbbff;">:htmlized-source</span> t
         <span style="color: #ebbbff;">:recursive</span> t
         <span style="color: #ebbbff;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #ebbbff;">:section-numbers</span> 4
         <span style="color: #ebbbff;">:with-toc</span> nil
         <span style="color: #ebbbff;">:body-only</span> t)))
</pre>
</div>
</div></li></ol>
</div>


<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16"><span class="section-number-4">6.2.2</span> Emacs-lisp</h4>
<div class="outline-text-4" id="text-6-2-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-key emacs-lisp-mode-map (kbd <span style="color: #99ffff;">"C-c C-c"</span>) 'eval-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="section-number-4">6.2.3</span> HTML</h4>
<div class="outline-text-4" id="text-6-2-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span style="color: #99ffff;">"\\.html?\\'"</span> . web-mode))
(eval-after-load <span style="color: #99ffff;">"web-mode"</span>
  '(<span style="color: #d1f1a9;">setq</span> web-mode-enable-auto-expanding t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">6.2.4</span> JavaScript</h4>
<div class="outline-text-4" id="text-6-2-4">
</div><ol class="org-ol"><li><a id="orgheadline18"></a>Tern<br  /><div class="outline-text-5" id="text-6-2-4-1">
<p>
Tern 是一款 Javascript 代码分析工具. Tern-mode 在后台打开 tern server, 通过中间件与 emacs 通信, 实现 JS 代码补全和跳转.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">with-eval-after-load</span> 'company
  (add-to-list 'company-backends 'company-tern))
</pre>
</div>
</div></li>

<li><a id="orgheadline19"></a>js2-mode<br  /><div class="outline-text-5" id="text-6-2-4-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span style="color: #99ffff;">"\\.js\\'"</span> . js2-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #99ffff;">"\\.jsx\\'"</span> . js2-jsx-mode))
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">6.2.5</span> C#</h4>
<div class="outline-text-4" id="text-6-2-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span style="color: #99ffff;">"\\.cs\\'"</span> . csharp-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">6.2.6</span> Scala</h4>
<div class="outline-text-4" id="text-6-2-6">
</div><ol class="org-ol"><li><a id="orgheadline22"></a>scala-mode<br  /><div class="outline-text-5" id="text-6-2-6-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span style="color: #99ffff;">"\\.sbt\\'"</span> . scala-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #99ffff;">"\\.sc\\'"</span> . scala-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #99ffff;">"\\.scala\\'"</span> . scala-mode))
</pre>
</div>
</div></li>

<li><a id="orgheadline23"></a>ensime<br  /><div class="outline-text-5" id="text-6-2-6-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">(require 'ensime)</span>
<span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">(add-hook 'scala-mode-hook 'ensime-mode)</span>
</pre>
</div>
</div></li></ol>
</div>
</div>
</div>


<div id="outline-container-orgheadline30" class="outline-2">
<h2 id="orgheadline30"><span class="section-number-2">7</span> Customize</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">7.1</span> Toggle window split</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">defun</span> <span style="color: #ffc58f;">toggle-window-split</span> ()
  (<span style="color: #d1f1a9;">interactive</span>)
  (<span style="color: #d1f1a9;">if</span> (= (count-windows) 2)
      (<span style="color: #d1f1a9;">let*</span> ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (<span style="color: #d1f1a9;">and</span> (&lt;= (car this-win-edges)
                                         (car next-win-edges))
                                     (&lt;= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (<span style="color: #d1f1a9;">if</span> (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (<span style="color: #d1f1a9;">let</span> ((first-win (selected-window)))
          (funcall splitter)
          (<span style="color: #d1f1a9;">if</span> this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (<span style="color: #d1f1a9;">if</span> this-win-2nd (other-window 1))))))
</pre>
</div>
</div>
</div>
