_org/2016-08-20-Update_Emacs_Config.org
** sudo-editor
#+BEGIN_SRC emacs-lisp
(defun sudo-edit (&optional arg)
  "Edit currently visited file as root.

With a prefix ARG prompt for a file to visit.
Will also prompt for a file to visit if current
buffer is not visiting a file."
  (interactive "P")
  (if (or arg (not buffer-file-name))
      (find-file (concat "/sudo:root@localhost:"
                         (ido-read-file-name "Find file(as root): ")))
    (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))
#+END_SRC

** y-ret-or-n-p
#+BEGIN_SRC emacs-lisp
  (defun y-ret-or-n-p (prompt)
    (let ((answer 'recenter)
          (padded (lambda (prompt &optional dialog)
                    (let ((l (length prompt)))
                      (concat prompt
                              (if (or (zerop l) (eq ?\s (aref prompt (1- l))))
                                  "" " ")
                              (if dialog "" "(y [RET] or n) "))))))
      (cond
       (noninteractive
        (setq prompt (funcall padded prompt))
        (let ((temp-prompt prompt))
          (while (not (memq answer '(act skip)))
            (let ((str (read-string temp-prompt)))
              (cond ((member str '("" "y" "Y")) (setq answer 'act))
                    ((member str '("n" "N")) (setq answer 'skip))
                    (t (setq temp-prompt (concat "Please answer y [RET] or n.  "
                                                 prompt))))))))
       ((and (display-popup-menus-p)
             last-input-event             ; not during startup
             (listp last-nonmenu-event)
             use-dialog-box)
        (setq prompt (funcall padded prompt t)
              answer (x-popup-dialog t `(,prompt ("Yes" . act) ("No" . skip)))))
       (t
        (setq prompt (funcall padded prompt))
        (while
            (let* ((scroll-actions '(recenter scroll-up scroll-down
                                              scroll-other-window scroll-other-window-down))
                   (key
                    (let ((cursor-in-echo-area t))
                      (when minibuffer-auto-raise
                        (raise-frame (window-frame (minibuffer-window))))
                      (read-key (propertize (if (memq answer scroll-actions)
                                                prompt
                                              (concat "Please answer y [RET] or n.  "
                                                      prompt))
                                            'face 'minibuffer-prompt)))))
              (setq answer (lookup-key query-replace-map (vector key) t))
              (cond
               ((memq answer '(skip act exit)) nil)
               ((eq answer 'recenter)
                (recenter) t)
               ((eq answer 'scroll-up)
                (ignore-errors (scroll-up-command)) t)
               ((eq answer 'scroll-down)
                (ignore-errors (scroll-down-command)) t)
               ((eq answer 'scroll-other-window)
                (ignore-errors (scroll-other-window)) t)
               ((eq answer 'scroll-other-window-down)
                (ignore-errors (scroll-other-window-down)) t)
               ((or (memq answer '(exit-prefix quit)) (eq key ?\e))
                (signal 'quit nil) t)
               (t t)))
          (ding)
          (discard-input))))
      (let ((ret (memq answer '(act exit))))
        (unless noninteractive
          (message "%s%c" prompt (if ret ?y ?n)))
        ret)))

  (defalias 'yes-or-no-p 'y-ret-or-n-p) ;; 转换 yes/no 问题为 y/n 问题
  (defalias 'y-or-n-p 'y-ret-or-n-p) ;; 转换 yes/no 问题为 y/n 问题
#+END_SRC
