_posts/2016-08-20-Update_Emacs_Config.org.html

<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">7.2</span> sudo-editor</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">defun</span> <span style="color: #ffc58f;">sudo-edit</span> (<span style="color: #bbdaff;">&amp;optional</span> arg)
  <span style="color: #ebbbff;">"Edit currently visited file as root.</span>

<span style="color: #ebbbff;">With a prefix ARG prompt for a file to visit.</span>
<span style="color: #ebbbff;">Will also prompt for a file to visit if current</span>
<span style="color: #ebbbff;">buffer is not visiting a file."</span>
  (<span style="color: #d1f1a9;">interactive</span> <span style="color: #99ffff;">"P"</span>)
  (<span style="color: #d1f1a9;">if</span> (<span style="color: #d1f1a9;">or</span> arg (not buffer-file-name))
      (find-file (concat <span style="color: #99ffff;">"/sudo:root@localhost:"</span>
                         (ido-read-file-name <span style="color: #99ffff;">"Find file(as root): "</span>)))
    (find-alternate-file (concat <span style="color: #99ffff;">"/sudo:root@localhost:"</span> buffer-file-name))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">7.3</span> y-ret-or-n-p</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">defun</span> <span style="color: #ffc58f;">y-ret-or-n-p</span> (prompt)
  (<span style="color: #d1f1a9;">let</span> ((answer 'recenter)
        (padded (<span style="color: #d1f1a9;">lambda</span> (prompt <span style="color: #bbdaff;">&amp;optional</span> dialog)
                  (<span style="color: #d1f1a9;">let</span> ((l (length prompt)))
                    (concat prompt
                            (<span style="color: #d1f1a9;">if</span> (<span style="color: #d1f1a9;">or</span> (zerop l) (eq ?\s (aref prompt (1- l))))
                                <span style="color: #99ffff;">""</span> <span style="color: #99ffff;">" "</span>)
                            (<span style="color: #d1f1a9;">if</span> dialog <span style="color: #99ffff;">""</span> <span style="color: #99ffff;">"(y [RET] or n) "</span>))))))
    (<span style="color: #d1f1a9;">cond</span>
     (noninteractive
      (<span style="color: #d1f1a9;">setq</span> prompt (funcall padded prompt))
      (<span style="color: #d1f1a9;">let</span> ((temp-prompt prompt))
        (<span style="color: #d1f1a9;">while</span> (not (memq answer '(act skip)))
          (<span style="color: #d1f1a9;">let</span> ((str (read-string temp-prompt)))
            (<span style="color: #d1f1a9;">cond</span> ((member str '(<span style="color: #99ffff;">""</span> <span style="color: #99ffff;">"y"</span> <span style="color: #99ffff;">"Y"</span>)) (<span style="color: #d1f1a9;">setq</span> answer 'act))
                  ((member str '(<span style="color: #99ffff;">"n"</span> <span style="color: #99ffff;">"N"</span>)) (<span style="color: #d1f1a9;">setq</span> answer 'skip))
                  (t (<span style="color: #d1f1a9;">setq</span> temp-prompt (concat <span style="color: #99ffff;">"Please answer y [RET] or n.  "</span>
                                               prompt))))))))
     ((<span style="color: #d1f1a9;">and</span> (display-popup-menus-p)
           last-input-event             <span style="color: #7285b7; font-style: italic;">; </span><span style="color: #7285b7; font-style: italic;">not during startup</span>
           (listp last-nonmenu-event)
           use-dialog-box)
      (<span style="color: #d1f1a9;">setq</span> prompt (funcall padded prompt t)
            answer (x-popup-dialog t `(,prompt (<span style="color: #99ffff;">"Yes"</span> . act) (<span style="color: #99ffff;">"No"</span> . skip)))))
     (t
      (<span style="color: #d1f1a9;">setq</span> prompt (funcall padded prompt))
      (<span style="color: #d1f1a9;">while</span>
          (<span style="color: #d1f1a9;">let*</span> ((scroll-actions '(recenter scroll-up scroll-down
                                            scroll-other-window scroll-other-window-down))
                 (key
                  (<span style="color: #d1f1a9;">let</span> ((cursor-in-echo-area t))
                    (<span style="color: #d1f1a9;">when</span> minibuffer-auto-raise
                      (raise-frame (window-frame (minibuffer-window))))
                    (read-key (propertize (<span style="color: #d1f1a9;">if</span> (memq answer scroll-actions)
                                              prompt
                                            (concat <span style="color: #99ffff;">"Please answer y [RET] or n.  "</span>
                                                    prompt))
                                          'face 'minibuffer-prompt)))))
            (<span style="color: #d1f1a9;">setq</span> answer (lookup-key query-replace-map (vector key) t))
            (<span style="color: #d1f1a9;">cond</span>
             ((memq answer '(skip act exit)) nil)
             ((eq answer 'recenter)
              (recenter) t)
             ((eq answer 'scroll-up)
              (<span style="color: #d1f1a9;">ignore-errors</span> (scroll-up-command)) t)
             ((eq answer 'scroll-down)
              (<span style="color: #d1f1a9;">ignore-errors</span> (scroll-down-command)) t)
             ((eq answer 'scroll-other-window)
              (<span style="color: #d1f1a9;">ignore-errors</span> (scroll-other-window)) t)
             ((eq answer 'scroll-other-window-down)
              (<span style="color: #d1f1a9;">ignore-errors</span> (scroll-other-window-down)) t)
             ((<span style="color: #d1f1a9;">or</span> (memq answer '(exit-prefix quit)) (eq key ?\e))
              (<span style="color: #ff9da4; font-weight: bold;">signal</span> 'quit nil) t)
             (t t)))
        (ding)
        (discard-input))))
    (<span style="color: #d1f1a9;">let</span> ((ret (memq answer '(act exit))))
      (<span style="color: #d1f1a9;">unless</span> noninteractive
        (message <span style="color: #99ffff;">"%s%c"</span> prompt (<span style="color: #d1f1a9;">if</span> ret ?y ?n)))
      ret)))

(<span style="color: #d1f1a9;">defalias</span> '<span style="color: #ffc58f;">yes-or-no-p</span> 'y-ret-or-n-p) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#36716;&#25442; yes/no &#38382;&#39064;&#20026; y/n &#38382;&#39064;</span>
(<span style="color: #d1f1a9;">defalias</span> '<span style="color: #ffc58f;">y-or-n-p</span> 'y-ret-or-n-p) <span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">&#36716;&#25442; yes/no &#38382;&#39064;&#20026; y/n &#38382;&#39064;</span>
</pre>
</div>
</div>
</div>
</div>
